In [2]:
import pandas as pd

In [3]:
s=pd.Series(["HUMID","DRY","RAIN"],name="event")
s

0    HUMID
1      DRY
2     RAIN
Name: event, dtype: object

In [4]:
df1=pd.DataFrame({
    "city":["NEW YORK","CHICAGO","ORLANDO"],
    "temperature":[21,14,35],
    })
df2=pd.DataFrame({
    "city":["NEW YORK","CHICAGO","ORLANDO"],
    "HUMIDITY":[65,68,75],
    })
print(df1)
print(df2)

       city  temperature
0  NEW YORK           21
1   CHICAGO           14
2   ORLANDO           35
       city  HUMIDITY
0  NEW YORK        65
1   CHICAGO        68
2   ORLANDO        75

In [7]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

       city  temperature  HUMIDITY
0  NEW YORK           21        65
1   CHICAGO           14        68
2   ORLANDO           35        75

In [8]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

       city  temperature  HUMIDITY
0  NEW YORK           21        65
1   CHICAGO           14        68
2   ORLANDO           35        75

In [10]:
# WEATHER BY CITIES
import pandas as pd
df=pd.read_csv("weather_by_cities.csv.xls")
print(df)

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [18]:
g=df.groupby("city")
print(g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002B424A964A0>

In [21]:
for city,data in g:
  print()
  print("city:",city)
  print("data:",data)

city: mumbai
data:         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

city: new york
data:         day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

city: paris
data:          day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [22]:
g.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [15]:
g.max()     #returns max value in each group,data

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [16]:
g.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

In [17]:
g.count()

          day  temperature  windspeed  event
city
mumbai      4            4          4      4
new york    4            4          4      4
paris       4            4          4      4